{"announcements":{"notice":"Drinks tonight at Alibi room. 9:00pm","alert":"urgent - looking for a DIV to VGA cable in room 201"},"details":{"when":"Thursday June 11 - Friday June 12th 2009","where":"Vancouver Convention and Exhibition Centre (VCEC)","geolocation":"49.314324,-123.107815","wifi-password":"TBA"},"sessions":[{"datetime":"2009-06-11 10:30","speaker":{"name":"Morgan Tocker","twitter":"","thumb":"http:\/\/openwebvancouver.ca\/sites\/default\/files\/imagecache\/mobile_thumb\/morgan_tocker.jpg","site":"http:\/\/mtocker.livejournal.com","bio":"My name is Morgan Tocker. I work for MySQL AB as a Support Engineer.\r\n\r\nIn my spare time, I like to contribute to Open Source software, ride my road bike, and throw things at unsuspecting victims.\r\n\r\nIn a former life, I worked as a PHP\/MySQL developer part-time while studying IT\/Journalism at the University of Queensland. I've not finished -- It's just on hold for a little while."},"title":"Performance Tuning MySQL","description":"This talk looks at the ways that people approach problems when they decide that it's time to improve database performance.  The three main strategies I'll be looking at are - Add Hardware, Change a buffer or cache setting, or add an index.  To some degree, each strategy works, but which one is the best, and when? (Hint: come to the talk to find out).\r\n\r\nI will be using examples with real life data sets - and the audience will be encouraged to join in and answer questions as to 'why things work this way'.  Attendees that have war stories to share will always welcome!","track":"A","room":"201"},{"datetime":"2009-06-11 10:30","speaker":{"name":"Evan Prodromou","twitter":"evanprodromou","thumb":"http:\/\/openwebvancouver.ca\/sites\/default\/files\/imagecache\/mobile_thumb\/evan_prodromou.jpg","site":"http:\/\/evan.prodromou.name","bio":"I was born 14 October 1968 in Cincinnati, Ohio but moved to California at an early age. After graduating with a major in physics and a minor in English at the University of California at Berkeley in 1990, I spent a year writing software in Amsterdam before returning to San Francisco to join the nascent Internet boom. I did a stint working for Microsoft's Bay Area office, then I lept into the Web with both feet, working on dozens of Web sites and Web software packages between 1995 and 2001. I developed a passion for Open Source software and Open Content, grass-roots Internet culture, and SF's Burning Man-oriented techno-artistico-music scene. I was lucky enough to meet my wife Maj during this time.\r\n\r\nIn 2001 I got a generous layoff package from RSA Security and took the opportunity to quit the expensive hurly-burly SF lifestyle. I piled my belongings into the back of my beloved 1972 Citroen DS and spent the next 6 months alone driving around Canada, the United States, and Mexico. I eventually settled in Montreal to write my first novel (still unfinished), then joined Maj in Geneva for a round-the-world trip including touring Southeast Asia and living in Lisbon for a season. We returned to Montreal in July 2003 for Maj to start graduate school at McGill University, and as a side-project started Wikitravel.\r\n\r\nA year later, we were married on the platform of the Biodome in Montreal. Today, we're still living in Montreal, parents of a beautiful 8-month-old girl named Amita June. I work on Wikitravel full time doing development and system administration, and try to find time to write. "},"title":"Identi.ca: Open Source Microblogging with Laconica","description":"Microblogging lets people share short status messages with their social network. Public Web sites like Twitter, Jaiku and Plurk are wildly popular with consumers, but Open Source programs allow a distributed social graph and implementation inside the enterprise firewall. Evan Prodromou, founder of Identi.ca, will describe the Open Source microblogging tool Laconica and its uses in the workplace and on the Public Web.\r\n<!--break-->\r\nEvan Prodromou is a developer and entrepreneur based in Montreal. Best known for starting Wikitravel, the collaborative Open Content travel guide, he has worked on Open Source software and the Web for 13 years. His most recent project, Identi.ca, is a microblogging site with 40,000 registered users. Prodromou is founder and CEO of Control Yourself, Inc., which manages Identi.ca and provides service and support for the Laconica microblogging software.","track":"A","room":"201"},{"datetime":"2009-06-11 10:30","speaker":{"name":"Andy McKay","twitter":"clearwind","thumb":"http:\/\/openwebvancouver.ca\/sites\/default\/files\/imagecache\/mobile_thumb\/andy_mckay.jpg","site":"http:\/\/www.agmweb.ca\/blog\/andy\/","bio":"Andy McKay works at Clearwind Consulting and can emailed at andy@clearwind.ca. If you are a web developer you might want to give Arecibo a quick look."},"title":"Cross Domain Web Mashups with JQuery and Google App Engine","description":"Over the past year some really great tools and practices have appeared for creating web mashups simply and quickly. Google's App Engine allows the easy creation and deployment of servers to provide the source for data. JQuery on the client makes of rich browser side tools utilising the back end data.\r\n\r\nThis talk will cover how to do mashups from the Python code in Google App Engine, utilising some diverse data sources. It will then move to the front end and complete with Javascript using JQuery and JSONP show how to provide a great cross browser and cross domain application.\r\n\r\nThe end result is an application in Javascript that can be deployed on any web site quickly with just a few lines of code.","track":"A","room":"201"},{"datetime":"2009-06-11 10:30","speaker":{"name":"Joe Bowser","twitter":"infil00p","thumb":"http:\/\/openwebvancouver.ca\/sites\/default\/files\/imagecache\/mobile_thumb\/joe_bowser_0.jpg","site":"http:\/\/www.infil00p.org","bio":"I’m the person who works behind the scenes with client projects, tackling the esoteric things such as deployments, and unconventional uses\/abuses of Ruby, PHP and Javascript. Before Nitobi, I did some QA work at a company North Vancouver, and before all that I did a brief stint in the world of Campus and Community Radio after getting my BSc from the University of Northern British Columbia.\r\n\r\nI’m one of the co-founders of Vancouver Hacker Space, which is part of the Hackerspaces Movement. VHS will be featured in the new book “Hackerspaces Everywhere”, which should be coming out sometime in 2009."},"title":"Hacking with Android: A Gateway to the Open Mobile Web","description":"The mobile web in many countries has been a source of innovation in Open Source Technologies.  Recent developments in web technology by a few companies have opened up the web to a new class of devices, such as the iPhone, the Google <a href=\"http:\/\/www.android.com\">Android<\/a> and the Palm Pre.  This talk is about the Open Mobile Alliance's Android Platform,and how it is different from it's competitors, and from previous Open Source Phone efforts.  This talk will go into the history behind the Android, the architecture of the Android Stack, as well as Android Software Development, both with Java and with the Nitobi <a href=\"http:\/\/www.phonegap.com\">PhoneGap API<\/a>.  This presentation will include a live demo where an Android Application will be written either from scratch or from the Android version of PhoneGap.","track":"A","room":"201"},{"datetime":"2009-06-11 10:30","speaker":{"name":"Drew Smith","twitter":"mux","thumb":"http:\/\/openwebvancouver.ca\/sites\/default\/files\/imagecache\/mobile_thumb\/drew_smith.jpg","site":"http:\/\/disengage.ca","bio":"Drew Smith is a longtime Linux network administrator, technology fetishist, security and privacy advocate, futurist and technological nomad.  When not riding his bike around or making music, he can usually be found geeking at home aboard 'Tie Fighter', his 39-foot sailing trimaran."},"title":"Building Castles in the Clouds","description":"'Cloud Computing' is an oft-heard buzzword lately - the premise is that instead of having \"real\" servers in a colocation facility somewhere, these servers are virtualized, theoretically allowing for agile development, rapid deployment and retirement, easy scaling and significant reductions in cost.\r\n\r\nBut how many folks are actually taking this beyond the theory?  In this session, we'll discuss the basics of cloud computing, and then focus specifically on computing within the Amazon EC2 Elastic Computing Cloud.  We'll cover some of the bigger pitfalls and gotchas, and examine the down-and-dirty real-world details of migrating a large, heavily trafficked Drupal-based website out of a regular colocation facility and into the EC2 cloud.  Topics covered will include working day-to-day within the cloud environment, building custom machine images, scaling Apache and MySQL, storage and bandwidth considerations, performance metrics, load balancing and auto-scaling. You'll also hear opinions on why this technology is so awesome, and where we think it's going next.","track":"A","room":"201"},{"datetime":"2009-06-11 10:30","speaker":{"name":"Keith Grennan","twitter":"keeth","thumb":"http:\/\/openwebvancouver.ca\/sites\/default\/files\/imagecache\/mobile_thumb\/keith_grennan.jpg","site":"http:\/\/www.nearlyfree.org","bio":"Keith is a member of the Sprout development team, applying his diverse skills to the unique challenges of Sprout. Prior to Sprout, Keith was lead developer at Sxip Identity, where he co-authored the Sxipper identity management system, and at ActiveState\/Sophos where he helped PureMessage become an industry-leading anti-spam solution. Keith enjoys practicing Lightwork meditation, goofing off with his friends and beautiful wife, and creating an ecovillage on an island near Vancouver, Canada. Keith has a Bachelor of Computer Engineering degree from the University of Victoria."},"title":"Open Web \/ Open Mind - Meditation in a Connected World","description":"Humanity has traditions of meditation and contemplation with roots in the earliest civilizations.  Scientific and religious writings often agree on the benefits of practicing quiet inward focus.  But how does meditation fit into the frenetic, noisy, social landscape of the connected world?  Can meditation help make the web better, and vice-versa?  Or are they fundamentally at odds?  I'll present a brief survey of attempts to bring meditation to the web, demo my own soon-to-be-launched online meditation project, and look at future possibilities.  I hope this talk leaves you feeling a little more peaceful and refreshed!","track":"A","room":"201"},{"datetime":"2009-06-11 10:30","speaker":{"name":"James A. Duncan","twitter":"","thumb":"http:\/\/openwebvancouver.ca\/sites\/default\/files\/imagecache\/mobile_thumb\/james_duncan.jpg","site":"","bio":""},"title":"The Smart Platform","description":"The era of the platform-as-a-Service is coming.  With the development cycle of new applications shrinking, and the scope of those applications becoming more focussed, the ability to deploy, and scale new applications is becoming a critical to any businesses success.\r\nJoyent's Smart Platform is an open source Platform-as-a-Service,  letting developers to build scalable, complex web applications in JavaScript that runs on the server, and then deploy those applications into the \"cloud\" using Git.\r\n<!--break-->\r\nWhile many cloud-services are focussing on the primitives - machines and storage - long term organizations embracing the cloud will want to move up the stack, where they no longer need to worry about operating systems, backups, or security patches.\r\n\r\nThe talk will outline some of the economic imperatives for the rise of a the Platform-as-a-Service, discuss the need for not only open standards, but open source, and demonstrate some of the Smart Platform's capabilities.","track":"A","room":"201"},{"datetime":"2009-06-11 10:30","speaker":{"name":"Franklin López","twitter":"stimulator","thumb":"http:\/\/openwebvancouver.ca\/sites\/default\/files\/imagecache\/mobile_thumb\/franklin_lopez.jpg","site":"http:\/\/submedia.tv","bio":"Franklin López exposes crucial current trends with video montages that mix culture jamming, news, satire, music and action to scratch the social justice itch. An award winning filmmaker hailing from San Juan, Puerto Rico, his films have been screened all over Europe and the United States, the Philippines, Indonesia, Japan and Brazil. His work has been written about in the New York Times, The Washington Post and featured on Canada’s City TV, GNN, Current, BET and Free Speech TV. "},"title":"Documenting Dissent","description":"Last year Franklin López of http:\/\/subMedia.tv , traveled to Denver and Saint Paul to cover the protests outside the Democratic and Republican Conventions for his Web show \"It's the End of the World as We know it and I feel fine\"\r\n\r\nUnless you watched Frank's show or any other of the independent media outlets covering the protests, you would have never known that thousands converged in opposition to the major political parties in the US, or that the police in both cities behaved in a most un-democratic way.\r\n\r\nJoin Franklin López as he recounts his experiences as a web news producer, what tools he used, the technical hurdles him and his colleagues had to overcome and how he is planning to cover the protests during the 2010 Olympic Games.\r\n","track":"A","room":"201"},{"datetime":"2009-06-11 10:30","speaker":{"name":"Angela Byron","twitter":"webchick","thumb":"http:\/\/openwebvancouver.ca\/sites\/default\/files\/imagecache\/mobile_thumb\/angela_byron.jpg","site":"http:\/\/webchick.net","bio":"I live in Montréal, Québec, Canada with my wife Marci and our \"kids\" Oscar, Pickle, Bebop, and Cooper. I'm obsessed with Drupal, working with open source and getting new people (especially women) involved, and just geeky computer stuff in general. When the keyboard is pried from my hands once or twice a year, I enjoy video games, logic puzzles, drawing silly cartoons, and political books and documentaries."},"title":"KEYNOTE - Women in Open Source","description":"The open source world is rich with opportunities: Working with people of all cultures from all over the world; Collaborating with some of the biggest and brightest minds on the ultimate solutions to complicated problems; Changing the world by providing free tools for organizations such as non-profits, educational institutions, and governments; Building up marketable skills and practical knowledge.\r\n\r\nBut yet, so many women are missing out. Why is that? And what can we do to change it? This talk will endeavour to answer these questions, as well as provide tips and strategies for women who want to dip their toe into the waters.\r\n","track":"A","room":"201"},{"datetime":"2009-06-11 10:30","speaker":{"name":"Karoly Negyesi","twitter":"","thumb":"http:\/\/openwebvancouver.ca\/sites\/default\/files\/imagecache\/mobile_thumb\/karoly_negyesi.jpg","site":"http:\/\/drupal4hu.com","bio":"Within the Drupal community, our beloved chx (Károly Négyesi), who cannot be distracted, is recognized as the Drupal core developer with the most code via patches.\r\n\r\nWhat is not known, is that Károly is also a national hero in his native Hungary. During my summer visit to Budapest, I saw an amazing number of signs in his recognition: There are streets named after him, and even parks!\r\n\r\nSee the photo set on Flickr.\r\n\r\nSince the signs are in Magyar, Hungary's national language, I went to an expert on that language who is a university professor and a native speaker too. He confirmed that \"kert\" means \"cannot be distracted\", and \"korut\" means \"does not sleep\", and \"V. ker. Belvaros\" means \"very cool Drupal core developer\".\r\n\r\nNice to see Karoly get the recognition he deserves. "},"title":"Sometimes you need to rewrite the code...","description":"Sometimes a piece of code is beyond simple fixing. It's time to scratch it and rebuild the functionality from the ground up. For Drupal 6, this was the menu system. For non-Drupalers: the menu system in Drupal has many, many roles, far beyond the simple task of displaying a menu tree. In this talk, I will tell the history of this rewrite, one of the largest rewrites in the history of Drupal and share a few lessons which are likely to be useful to everyone who ever go down the \"let's rewrite\" route with an open source project -- maybe even during any software development.","track":"A","room":"201"},{"datetime":"2009-06-11 10:30","speaker":{"name":"Scott Nelson","twitter":"obinine","thumb":"http:\/\/openwebvancouver.ca\/sites\/default\/files\/imagecache\/mobile_thumb\/scott_nelson.jpg","site":"http:\/\/virishi.net","bio":"Scott Nelson started one of Canada's first web development firms in 1993 (Communicopia) and has made his living from the Internet ever since. He co-founded FreeGeek Vancouver, Indymedia, the Vancouver Open Network Initiative Cooperative and served on the board of the Vancouver Community Net for 5 years."},"title":"Collapsonomics 101 - Finding Opportunity Amidst The Chaos","description":"This talk will examine some of the opportunities that the current recession offer for the open web. From keeping your skills honed and relevant to accelerating the shift away from expensive licensing to taking advantage of economies of scale by pushing your services to the cloud and extending into mobile, this session will look at how best to focus entrepreneurial time and resources during what is sure to be a bumpy transition from late stage capitalism to some semblance of sustainability.\r\n<!--break-->\r\n","track":"A","room":"201"},{"datetime":"2009-06-11 10:30","speaker":{"name":"Graham King","twitter":"","thumb":"http:\/\/openwebvancouver.ca\/sites\/default\/files\/imagecache\/mobile_thumb\/graham_king.jpg","site":"http:\/\/www.darkcoding.net","bio":"My speaking experience includes a BarCamp (in London), and many Toastmasters meetings (in Santa Monica)."},"title":"How and Why to Extend Firefox in Javascript (and Thunderbird, Komodo, and Songbird)","description":"If you know Javascript, writing Firefox extensions is easy! \r\n\r\nWe talk briefly about the wonderful things you can do in a Firefox extenion (native drag and drop! filesystem access!), then this talks gets you up the learning curve fast. \r\nWe introduce the extension package structure and how Firefox provides services to your extension. We'll cover XUL, XPCOM and RDF, and finally how you build and release your extension to the world.\r\n\r\nIn closing, we'll see that this knowledge applies to all Mozilla XULRunner based apps, so we'll also extend Thunderbird, Komodo Edit, and Songbird.","track":"A","room":"201"},{"datetime":"2009-06-11 10:30","speaker":{"name":"Angela Byron","twitter":"webchick","thumb":"http:\/\/openwebvancouver.ca\/sites\/default\/files\/imagecache\/mobile_thumb\/angela_byron.jpg","site":"http:\/\/webchick.net\/","bio":"I live in Montréal, Québec, Canada with my wife Marci and our \"kids\" Oscar, Pickle, Bebop, and Cooper. I'm obsessed with Drupal, working with open source and getting new people (especially women) involved, and just geeky computer stuff in general. When the keyboard is pried from my hands once or twice a year, I enjoy video games, logic puzzles, drawing silly cartoons, and political books and documentaries."},"title":"Drupal: Under the Hood","description":"You may have heard of <a href=\"http:\/\/drupal.org\/\">Drupal<\/a>, the fantastic open source content management framework that's powering sites such as <a href=\"http:\/\/www.ubuntu.com\/\">Ubuntu<\/a>, <a href=\"http:\/\/www.recovery.gov\/\">Recovery.gov<\/a> and <a href=\"http:\/\/www.theonion.com\/content\/index\">The Onion<\/a>. But do you know what powers Drupal?\r\n\r\nCome to this talk to get some details on how Drupal works, an explanation of the APIs provided for extending it, some of the nifty stuff you can do to make your web projects awesome, and what's up and coming in the development version (Drupal 7).\r\n\r\nPS: I'm a huge Drupal geek, so will also leave time at the end for questions and answers about whatever general Drupalish topics people might like to know about. :) And incidentally, if you have feedback of what other things you'd like to see in addition\/instead of at this presentation, drop me a line!","track":"A","room":"201"},{"datetime":"2009-06-11 10:30","speaker":{"name":"Brock Whitten","twitter":"sintaxi","thumb":"http:\/\/openwebvancouver.ca\/sites\/default\/files\/imagecache\/mobile_thumb\/brock_whitten.jpg","site":"http:\/\/sintaxi.com","bio":"Brock is a software developer at <a href=\"http:\/\/nitobi.com>Nitobi<\/a>. He loves Ruby and is very passionate about the mobile web. Brock is the maintainer and one of the brains behind the PhoneGap project."},"title":"Javascript mobile development using PhoneGap - I cant believe its not native!","description":"Brock Whitten, is a returning speaker to Open Web Vancouver. Brock is Co-Founder of the PhoneGap project and is going to give an in depth overview of the award winning framework PhoneGap.\r\n\r\n<a href=\"http:\/\/phonegap.com\">PhoneGap<\/a> is an open source development tool for building fast, easy mobile apps with JavaScript. PhoneGap exposes Geolocation, Accelerometer, Vibration, Sound, and Contact support for iPhone, Android and BlackBerry using the HTML5 spec. In this talk you will learn:\r\n\r\n* How to get started with PhoneGap\r\n* How to quickly and easily convert web applications to a mobile app.\r\n* How to overcome cross-device barriers\r\n* How to access core device functions such as GeoLocation and Accelerometer\r\n\r\nThe Barrier of entry for building mobile applications has never been lower. There are over 50 known applications in the Apple App Store that are built on the PhoneGap framework.","track":"A","room":"201"},{"datetime":"2009-06-11 10:30","speaker":{"name":"Joe Bowser and other members of VHS","twitter":"VanHackSpace","thumb":"http:\/\/openwebvancouver.ca\/sites\/default\/files\/imagecache\/mobile_thumb\/joe_bowser.jpg","site":"http:\/\/vancouver.hackspace.ca","bio":"I’m the person who works behind the scenes with client projects, tackling the esoteric things such as deployments, and unconventional uses\/abuses of Ruby, PHP and Javascript. Before Nitobi, I did some QA work at a company North Vancouver, and before all that I did a brief stint in the world of Campus and Community Radio after getting my BSc from the University of Northern British Columbia.\r\n\r\nI’m one of the co-founders of Vancouver Hacker Space, which is part of the Hackerspaces Movement. VHS will be featured in the new book “Hackerspaces Everywhere”, which should be coming out sometime in 2009."},"title":"Hackerspaces: Making, Sharing, Hacking and Doing Things","description":"* in the hackspace\r\n\r\nThe hackerspace movement is a relatively new movement of collaborative spaces throughout the world.  These spaces, called \"YMCA for geeks\", are places where Makers, Crafters, Hackers and other people who have knowledge to share and projects to do can come together to work on them in a collaborative atmosphere.\r\n\r\nThis movement has been featured in <a href=\"http:\/\/blog.wired.com\/gadgets\/2009\/03\/hackerspaces.html\">WIRED<\/a>, and individual hackerspaces have been featured in the past in MAKE Magazine, on NPR and in other media.  The emphasis of this talk will of course be on the local Vancouver space, Vancouver Hacker Space and the progress that they have made over the past year.\r\n\r\nThis is a collaborative talk, and members from other hackerspaces are also welcome to attend and participate. ","track":"A","room":"201"},{"datetime":"2009-06-11 10:30","speaker":{"name":"J. Dumbrille, S. Cole, P. Rawsthorne, M. Groen","twitter":"","thumb":"http:\/\/openwebvancouver.ca\/sites\/default\/files\/imagecache\/mobile_thumb\/bowen_island_0.jpg","site":"","bio":""},"title":"From community to municipal hall. Bowen Island: the development of web based tools for citizen engagement.","description":"We look at how the development of web based tools for citizen engagement has been used in a small community near Vancouver. Over the past year on Bowen Island, a qualitative, spontaneous shift has taken place in grassroots technology adoption that is affecting significant cultural, political and social change. The session involves four different narratives from four different community members who have made a difference.\r\n\r\nThe four presenters will present a mixed narrative, revealing  how online technologies and social media has and can be used by engaged citizens, with a special focus on the build and influence of the road mapping tool developed by Stuart and Mark in 2008-9.\r\n\r\n* Pre-2000: Official Community Plan (OCP) – traditional gov’t processes with town hall meetings; nominal use of technologies.\r\n\r\n* Early 2000 - present: Bowen Forum, Bowen Island Municipal Website, push email campaigns, web assisted letter writing.\r\n\r\n* 2005 – 2007: Blogs erupt – Salish Sea, Bowen Island Journal, One Day Bowen; Wiki – Bowen2020 (Bowfeast), Advocacy Websites - CRC\r\n\r\n* Early 2008: Opening up the middle-school; IPS, Google Docs & WikiEducator\r\n\r\n* Late 2008: Tagging and facing the problem with platforms\r\n\r\n* Late 2008:\r\n-Full on tagging and hashtagging: BOWEGOV on Del.icio.us and #BOWEGOV on Twitter\r\n-Road status tool (PhP, MySQL, Google Maps mashup); Flickr\r\n\r\n* Early-mid 2009:\r\n-bowegover.ning,  a citizen-led governance project\r\n-participate in Vanchangecamps' organization to build political cohesiveness\r\n\r\nThis session will conclude with a discussion of our  approaches to influencing policy change using accessible tools, the challenges to adoption, and our planned next steps in using open tools for citizen engagement, self-direction and a more cohesive, inclusive community.","track":"A","room":"201"},{"datetime":"2009-06-11 10:30","speaker":{"name":"James Walker","twitter":"walkah","thumb":"http:\/\/openwebvancouver.ca\/sites\/default\/files\/imagecache\/mobile_thumb\/james_walker.jpg","site":"http:\/\/walkah.net","bio":"I am James Walker\r\n\r\nI am a father, a geek, a drummer, a (former) hockey goalie, a music nerd, a free software advocate, a beer drinker, a thinker, a cancer, a flirt, a closet singer, a dork, a hugger, a clown, and alive.\r\n\r\nI am not much of an about page author."},"title":"Powering the Open Web with Drupal","description":"The future of the open web will increasingly depend on the strength of open platforms. The power of open data and open standards is in connecting disparate information sources and effectively serving the \"long tail\" of individuals and smaller organizations. Drupal (http:\/\/drupal.org\/) is perfectly positioned as a tool of choice.\r\n\r\nDrupal is a popular open source content management system with a long-standing tradition of supporting open standards. From early support for both RSS feed creation as well as aggregation, to modern day efforts surrounding OpenID, OAuth and the DiSo project, Drupal remains a leader in the space and an excellent tool for building sites that participate in the open web.\r\n\r\nIn this presentation, we'll take a look at what the Drupal project is doing to participate in larger internet and power the open web.","track":"A","room":"201"},{"datetime":"2009-06-11 10:30","speaker":{"name":"Liza Kindred","twitter":"LizaK","thumb":"http:\/\/openwebvancouver.ca\/sites\/default\/files\/imagecache\/mobile_thumb\/liza_kindred.jpg","site":"http:\/\/www.lizakindred.com","bio":"Liza is Business Director and Managing Partner at Lullabot, a virtual open-source (Drupal) consulting and education company. Lullabot does high-level consultation and site architecture, and produces workshops around the globe. Lullabot also puts out the most popular Drupal podcast, is producing training DVDs, helped write the best selling Drupal book, and wrote the O'Reilly Drupal book.\r\n\r\nLiza handles all operations and HR, works on marketing and brand management, helps with new projects, builds client relationships, runs the finances, administers benefits, and generally tries to keep everyone happy and productive. It seems to be working...\r\n\r\nBefore the tech life, Liza worked in the fashion industry for more than a decade. Past experience includes owning her own boutique, serving as Fashion Editor for a newspaper, and attending markets across the country as a fashion apparel buyer. Liza has produced more than a dozen local fashion shows, as well as events for such regional and national names as Macy’s, Wacoal, and Polo Kids. "},"title":"Open Source Business","description":"The Open Source Initiative says that “Open Source is a way for people to collaborate on software without being encumbered by the problems of intellectual property.” Liza says that Open Source is also a way for businesses to espouse the qualities of openness and collaboration and harness them into successful, modern business models.\r\n\r\nThe very first tenant of Open Source talks about 'Free Redistribution', and it is this free distribution of ideas that is imperative to companies that want to grow in today's intellectual marketplace.\r\n\r\nCome learn how to these ideas, and how you can learn from the very code we work with to become more \"Open Source\" in your business model. We all know that proprietary software is a thing of the past; come learn why closed business models are on their way out as well.","track":"A","room":"201"},{"datetime":"2009-06-11 10:30","speaker":{"name":"Djun Kim, Ph.D.","twitter":"djun_kim","thumb":"http:\/\/openwebvancouver.ca\/sites\/default\/files\/imagecache\/mobile_thumb\/djun_kim.jpg","site":"http:\/\/www.puregin.org","bio":"math teaching software alternative energy furniture making "},"title":"Open Books, Open Minds, Open Source","description":"I will examine a number of (historical and current) software-based learning environments, specifically from the perspective of teaching and learning mathematics.  I'll present some case studies, drawing on experience teaching future teachers of mathematics using open-source tools such as the Scratch project from MIT.\r\n\r\nI'll reflect on 'digital natives' - the myth and the realities, disparage 'Ed-tech', coin a few neologisms, ponder a dynamical system or two,  gaze metaphorically into a scrying glass, and follow Doctor Flynn in asking whether we really <em>are<\/em> all getting smarter.  \r\n\r\nAlong the way I'll ask questions like \"what's the difference between computer science and mathematics, and why should everyone know something of each\", and \"what is still worth learning when everything worth knowing is just a click away\".\r\n<!--break-->\r\n","track":"A","room":"201"},{"datetime":"2009-06-11 10:30","speaker":{"name":"Kalin Harvey \/ Brenda Martens","twitter":"","thumb":"http:\/\/openwebvancouver.ca\/sites\/default\/files\/imagecache\/mobile_thumb\/kalin_harvey_brenda_martens.jpg","site":"http:\/\/recollective.ca","bio":"Brenda has over 15 years experience in the building industry working on residential, institutional, commercial and industrial projects throughout British Columbia.\r\n\r\nHer experience includes office, medical and rehabilitation renovations, recreation facilities, and libraries, the scopes vary from design, construction administration, and project management to facilities management and LEED Coordination. Brenda is deeply involved with the US and Canada Green Building Councils (USGBC and CaGBC) and the development community in the following roles:\r\n\r\n* Board of Directors, Cascadia Region Green Building Council\r\n* LEED Faculty\r\n* Technical Advisory Group (TAG) member\r\n* Chapter Committee of the CaGBC\r\n* NAIOP Development Issues Committee\r\n* City of Vancouver Green Building Strategy Committee"},"title":"What does Green Building have to do with Software Development?","description":"We are in the process of developing an open-source web 2.0 project for the green building community. The <a href=\"http:\/\/beta.greenbuildingbrain.org\/\" id=\"ao_4\" title=\"Green Building Brain\">Green Building Brain<\/a> is a database of green building and planning resources. By facilitating the sharing of information the project is designed to accelerate and increase the industry's impact on increasing building sustainability.\r\n\r\nThe open-source model of development has had a substantial impact on the field of sustainable, or green building.  Traditional design and construction has operated on a hierarchical model of decision making and protection of intellectual property, whereas green building design incorporates the shared development model of open-source, involving all designers, as well as the users and operators throughout the design and construction of a project.\r\n\r\nThere have been innovations in the field of green building that could also benefit the open-source development community. The Integrated Design Process (IDP) involves all of the project stakeholders in a series of design workshops or \"charrettes\", and has been practiced on scales from half a dozen participants to \"BIMStorms\", live on-line design charrettes involving whole cities and hundreds of participants. This process can be applied not only to buildings, but to any design problem, including software development. We will discuss how this process can be applied and how it was implemented on the \"Green Building Brain\" project.\r\n\r\nCombining online collaborative tools, with frequent intensive live interactions is also affecting the creation of a sustainable community. Drawing an existing community online is a challenging process, and many well-designed projects have failed due to not paying enough attention to this crucial step. We will discuss the challenges and lessons learned in taking a project from a small group of initiators, to a local community of stakeholders, and finally transitioning to an international user base.","track":"A","room":"201"},{"datetime":"2009-06-11 10:30","speaker":{"name":"John Boxall","twitter":"johnboxall","thumb":"http:\/\/openwebvancouver.ca\/sites\/default\/files\/imagecache\/mobile_thumb\/john_boxall.jpg","site":"http:\/\/johnboxall.ca","bio":"Genius billionaire playboy web developer."},"title":"Squinty Eyes","description":"Year over year reports of finger cramps are up five hundred percent in what doctors can only describe as \"really scary\". Researchers interviewing those afflicted by the dehabilitating illness identified unhealthy amounts of \"pinching\" and \"zooming\" to be the root cause. With deep concerns over a greater epidemic, Health Canada issued a stern warning to members of the web development community: Optimize your websites for mobile access or learn to love users with squinty eyes and claw hands.\r\n\r\nThe truth is most websites are not ready for the mobile visitors they already have. The past two years has seen tremendous growth in mobile internet usage in the Canadian and global marketplace. Smart phones are common and data plans are afford however the handset market remains fragmented with a large number of platforms and display sizes.\r\n\r\nLearn a language agnostic approach to designing a mobile view for a desktop website including identifying requests from mobile browsers, reformatting content for mobile and best practices for designing mobile sites.\r\n\r\n---\r\n\r\nJohn Boxall is the CTO of <a href=\"http:\/\/www.mobify.me\">Mobify<\/a>, a service for optimizing existing websites for mobile access. Once described as a \"Genius, billionaire, playboy web developer\" John's only regret that one part of his description wasn't true.","track":"A","room":"201"},{"datetime":"2009-06-11 10:30","speaker":{"name":"Luke Closs","twitter":"lukec","thumb":"http:\/\/openwebvancouver.ca\/sites\/default\/files\/imagecache\/mobile_thumb\/luke_closs.jpg","site":"http:\/\/awesnob.com","bio":"Luke Closs is a Perl Developer working for Socialtext. Socialtext's flagship product, Socialtext Workspace, is the first enterprise wiki and the foundation of the connected collaboration platform.  "},"title":"A8Ning - Open Web Testing","description":"We'll spend the first half of this talk talking about automated web testing - starting simple and then moving on to Business Driven Development (BDD).  In the second half of the talk, Luke will show examples of how he does this with his distributed global development\r\nteam at Socialtext. We'll finish up with Q&A.","track":"A","room":"201"},{"datetime":"2009-06-11 10:30","speaker":{"name":"Kaitlin Duck Sherwood","twitter":"","thumb":"http:\/\/openwebvancouver.ca\/sites\/default\/files\/imagecache\/mobile_thumb\/kaitlin_sherwood.jpg","site":"http:\/\/webfoot.com","bio":"Recently, I have been working on developing a mapping framework that allows one to overlay very high numbers of polygons and points on top of Google Maps. I have a demo which lets users overlay various demographic layers on top of the 2008 election results.\r\n\r\nI got an MS in Computer Science at the University of British Columbia I researched programmer productivity for my thesis, Path Exploration during Code Navigation, supervised by Gail Murphy. I then implemented a prototype of a differential code coverage tool and ran a user study to see if it was useful. It turns out to be really helpful.\r\n\r\nI'm proud of the two books I wrote: Overcome Email Overload with Eudora 5 and Overcome Email Overload with Microsoft Outlook 2000 and Outlook 2002.\r\n\r\nI have worked in a lot of places doing a lot of things in the high-tech industry. I am now actively looking for work. Ideally, I'd like a programming job in Vancouver BC where I can become fully buzzword compliant in the Java ecosystem (JEE, SOA, AJAX, Struts, Hibernate, Spring, etc.). I'd also like to be in a position to explore moving into management in two to three years. My second choice would be to move straight into management. "},"title":"Sita Sings the Blues - a Look at Copyleft in the Field","description":"    * Brief discussion of how the movie came to be made, i.e. a bit of the backstory of Nina's life, pointing towards why the Annette Henshaw recordings were so important to the film.\r\n    * About the film, including clips of each of the animation styles used in the film.  (NOT needed if the talk is in conjunction with a screening.  Instead, lots of \"as you will see in the film.)\r\n    * Copyright issues:\r\n          o Different rights for the songs e.g. performance, recording, etc. and how only one of the rights was not public domain.\r\n          o How copyright has changed since the songs were recorded (i.e. these songs \"should have\" been fully out of copyright.)\r\n          o Costs to Nina of getting full legal copyright for the songs in both money and time.\r\n    * Benefits of Nina making Sita Sings The Blues publicly available\r\n          o to Nina\r\n          o to the rights holders\r\n          o to the general public\r\n                + examples of how SSTB is being used\/mashed up (e.g. the LOLcats subtitles, the Thai fashion line)","track":"A","room":"201"},{"datetime":"2009-06-11 10:30","speaker":{"name":"Rick Vugteveen","twitter":"rickvug","thumb":"http:\/\/openwebvancouver.ca\/sites\/default\/files\/imagecache\/mobile_thumb\/rick_vugteveen.jpg","site":"http:\/\/rickvug.com\/","bio":"Rick’s work as the Sales Manager at ImageX Media focuses on providing solutions to the problems that our clients face. Rick’s main day-to-day duties at ImageX involve interacting with clients, chasing down leads, writing proposals and providing consulting services. As a “true believer” of Drupal’s vision and value, Rick finds himself evangelizing the platform wherever he goes.\r\n\r\nRick has been enthralled with technology and how things works for as long as he can remember. His continuous tinkering landed him a job at a local computer repair shop as a teenager. He has worked with technology ever since. Rick started working with ImageX part-time during his Sociology undergrad at the University of British Columbia. The most rewarding part of working at a small, growing company has been seeing how he can have direct impact on the direction and well-being of a business."},"title":"Crafting Better Open Source User Experiences","description":"\"Given enough eyeballs, all bugs are shallow.\"\r\n~Linus Torvalds (\"Linus's Law\")\r\n\r\nThe peer and the \"battle of ideas\" in open source software development has produced some of the most well architected software ever coded. However, the widespread consumer adoption of open source software has been hampered by usability issues. A pleasant user experience relies on a coherent, consistent and unified vision. In this context, \"Linus' Law\" starts to sound a lot more like \"too many cooks in the kitchen\".\r\n\r\nThis session will focus on the issues involved with creating a great user experience within an community driven open source project. I will compare and contrast various application user interfaces, calling out projects that are doing it wrong. I will also take a closer look at projects leading the way, sharing their insights and approaches.","track":"A","room":"201"},{"datetime":"2009-06-11 10:30","speaker":{"name":"Jean Hébert","twitter":"jeanh","thumb":"http:\/\/openwebvancouver.ca\/sites\/default\/files\/imagecache\/mobile_thumb\/jean_hebert.jpg","site":"http:\/\/clicknoise.net","bio":"musician, PhD student, social science researcher, dad"},"title":"The Mobile Web and the Public Sphere: Challenges and Affordances","description":"Mobilizing the web at this historical moment has heavy implications for the way we interact in and conceive of public spaces. At a moment in our local history  - 2010 Vancouver - where public space is being severely locked down and demarcated into official and unofficial zones of public participation, our rights as citizens to tell stories to each other is being challenged, by everything from the increase in surveillance of public spaces, corporate logo protectionism, archaic media accreditation processes and the throttling of networks to induce certain kinds of behaviour that are convenient, but totally unnecessary. Advocates of an open web must be cognizant of the political, economic and cultural minefield into which they are about to traipse. In this talk I will try to outline the features and problems of this new terrain, and will invite\/present live backchannel discussion on how to make these emerging, public, mobile networks our own.","track":"A","room":"201"},{"datetime":"2009-06-11 10:30","speaker":{"name":"David Ascher","twitter":"","thumb":"http:\/\/openwebvancouver.ca\/sites\/default\/files\/imagecache\/mobile_thumb\/david_ascher_0.jpg","site":"","bio":"David is the CEO of Mozilla Messaging, the Mozilla organization focused on the messaging aspects of Mozilla's mission to promote the open internet.  As such, David is involved both in the development of the Mozilla Thunderbird email client, and in a range of conversations about messaging on the web."},"title":"Open Messaging on the Open Internet","description":"It seems clear that an open web requires standards like HTML and HTTP.  It also seems clear, especially in areas like messaging, that layout and transport protocols are <em>not enough<\/em> to ensure the values that make the web open: interoperability, ability to evolve, hackability, and user control.  What else do we need to promote and protect the values that have made the web such a thriving environment?  What can we do about it?\r\n\r\nAt Mozilla, we've been spending some time exploring these issues, and thinking about what we can do to promote open messaging.  In my talk, I'll talk about the evolution of messaging on the net, recent developments, both exciting and worrisome, and where we see opportunities to make the web a better place.","track":"A","room":"201"},{"datetime":"2009-06-11 10:30","speaker":{"name":"Jacob Appelbaum","twitter":"ioerror","thumb":"http:\/\/openwebvancouver.ca\/sites\/default\/files\/imagecache\/mobile_thumb\/jacob_appelbaum.jpg","site":"http:\/\/www.appelbaum.net\/","bio":"Jacob Appelbaum is a resident of San Francisco, California, and both a photographer and independent computer security hacker. He currently is employed by the Tor project.\r\n\r\nHe is ambassador for the art group monochrom and known for his research on the cold boot attack amongst other things. [1][2]\r\n\r\nJacob is the executive director and a founder of the hackerspace Noisebridge, located in San Francisco.\r\n\r\n- http:\/\/en.wikipedia.org\/wiki\/Jacob_Appelbaum\r\n"},"title":"Tor: Anonymous Communications for the Dept of Defense...and you.","description":"What do the Department of Defense and the Electronic Frontier Foundation have in common? They have both funded the development of Tor (torproject.org), a free-software anonymizing network that helps people around the world use the Internet in safety. Tor's 1500 volunteer servers carry traffic for several hundred thousand users including ordinary citizens who want protection from identity theft and prying corporations, corporations who want to look at a competitor's website in private, and soldiers and aid workers in the Middle East who need to contact their home servers without fear of physical harm.\r\n\r\nI'll give an overview of the Tor architecture, and talk about why you'd want to use it, what security it provides, and policy and legal issues. Then we can open it up for discussion about open research questions, wider social implications, and other topics the audience wants to consider.","track":"A","room":"201"},{"datetime":"2009-06-11 10:30","speaker":{"name":"Boris Mann","twitter":"bmann","thumb":"http:\/\/openwebvancouver.ca\/sites\/default\/files\/imagecache\/mobile_thumb\/boris_mann.jpg","site":"http:\/\/bmannconsulting.com","bio":"Vancouver. Entrepreneur. Connection karma. Boot-upper. Drupal. Open source.\r\n\r\nBoris loves catchy titles and clever puns. He is ham fisted and can't draw or use photoshop to save his life. He does, however, have a deeply bass voice that can double as a PA Announcer, and thinks himself rather witty at the words."},"title":"Open data and Semantic Web Community Barn Raising","description":"Open source is now a term that is increasingly understood, or at least talked about. One of the next battles in keeping the web open is keeping data open - from the content we \"generate\" for many social sites to the closed silos of government and businesses.\r\n\r\nJust like open source, open data is a mix of technology, licensing, and attitude. Here in Vancouver, we've started experimenting with what I like to call a Semantic Web Community \"Barn Raising\" effort. Lots of people are interested in open data and related technology that supports it, like the semantic web, RDF, etc. But it's very hard to just have nice thought experiments about all this, we learn best by doing.\r\n\r\nRecently, I gave a talk at DrupalCon Washington DC talking about the semantic web. I said that RDFa is \"food for robots\", so what better data to experiment with than something related to food?\r\n\r\nThe project we're tackling is to collectively source restaurant information. The information will be stored in part on <a href=\"http:\/\/freebase.com\">Freebase<\/a>, as well as various front end mashups, iPhone apps, and other tools. Eventually, we hope to create an economic incentive so that some restaurants and\/or restaurant directory websites will expose their data semantically.\r\n\r\nThe talk will be a mix of community, policy, hand waving, and technology, as well as an open call to help with this project in your own city. You'll leave with some food for thought on how open data and the semantic web are evolving, and what you can do with it today.\r\n<!--break-->\r\nFor more information, see the following links:\r\n<ul>\r\n<li><a href=\"http:\/\/wiki.openrestaurants.org\">Open Restaurants Wiki<\/a><\/li>\r\n<li><a href=\"http:\/\/blog.baconpatiobeer.com\">BaconPatioBeer Blog<\/a><\/li>\r\n<li><a href=\"http:\/\/vancouver.freebase.com\">Vancouver base on Freebase<\/a><\/li>\r\n<\/ul>","track":"A","room":"201"},{"datetime":"2009-06-11 10:30","speaker":{"name":"Irwin Oostindie","twitter":"Dutchphoto","thumb":"http:\/\/openwebvancouver.ca\/sites\/default\/files\/imagecache\/mobile_thumb\/irwin_oostindie.jpg","site":"http:\/\/www.creativetechnology.org","bio":"Irwin is a Dutch\/Canadian artist and administrator doing cultural planning, cultural infrastructure development, and support for a media arts cluster in Vancouver's inner-city. www.creativetechnology.org is a 14,395 square foot media arts centre being developed parallel to a massive inner-city redevelopment www.woodwardsdistrict.com that opens before the 2010 Winter Olympics. Irwin works with Fearless Media as well as an ICT Cluster, a unique grouping of tech companies, open source activists, bloggers, low income residents and artist codesigning open source communications systems for this area—Canada's poorest neighbourhood."},"title":"Breaking Vancity's Digital Divide","description":"","track":"A","room":"201"},{"datetime":"2009-06-11 10:30","speaker":{"name":"Blake Mizerany","twitter":"bmizerany","thumb":"http:\/\/openwebvancouver.ca\/sites\/default\/files\/imagecache\/mobile_thumb\/blake_mizerany.jpg","site":"http:\/\/www.blakemizerany.com","bio":"Blake has been into ruby since way back in 2001, and is the creator of Sinatra, the popular ruby microframework. Blake spends his days at Heroku, where he makes mind-blowing features out of ruby and erlang, and often says “you’re doing it all wrong”. He speaks regularly at ruby events and in conjunction maintains a completely indiscernible beard-shaving schedule."},"title":"Sinatra","description":"How to quickly and elegantly tell the story of an HTTP request and have it acting to your will in production with nothing more than Ruby and Git. No MVC, no tricks, no obtrusive design patterns.  Just highly scalable, juicy, fun web stuff you'll be using on a daily basis from here on out.","track":"A","room":"201"},{"datetime":"2009-06-11 10:30","speaker":{"name":"Chris Messina","twitter":"chrismessina","thumb":"http:\/\/openwebvancouver.ca\/sites\/default\/files\/imagecache\/mobile_thumb\/chris_messina.jpg","site":"http:\/\/factoryjoe.com","bio":"Chris Messina is a San Francisco-based advocate of the open web, known for helping to advance such communities as Spread Firefox, BarCamp, coworking, and technology initiatives such as OpenID, OAuth, Activity Streams and microformats. He is on the board of the OpenID Foundation and works for Vidoop on the DiSo Project.\r\n\r\nHaiku\r\n\r\nOpen web advocate:\r\n\r\nBarCamp, Coworking, DiSo;\r\n\r\nCan has openness?"},"title":"Openness in the Era of Social Web","description":"In April of this year,  Richard Stallman, free software advocate and one of the original open source advocates, wrote about the \"Javascript Trap\", warning that obfuscated or complicated Javascript programs are potentially freedom-limiting. His treatise completely misses the point and reveals how little the open, free software movement of the past has to offer us in terms of understanding and ensuring freedom in cloud-based computing. \r\n\r\nMore recently, several companies attempted to develop their own cloud computing manifesto calling for openness in the industry. Notably missing from its signatories were companies like Google, Amazon, and Microsoft — calling into question the benefits and motivations of \"open\" initiatives today.\r\n\r\nMoreover, Google and a host of other companies have attempted— in efforts like OpenSocial — to take the long, slow road to developing a set of \"open\" technologies for social networking web gadgets. But is this really an altruistic effort to improve the web or merely intended to upset Facebook's success with a different platform?\r\n\r\nGiven how much the free, open software movement has achieved to date, I think that it's critical that we take a hard look at the next set of challenges that we will face in maintaining freedom on the social web.","track":"A","room":"201"},{"datetime":"2009-06-11 10:30","speaker":{"name":"Rickard Falkvinge","twitter":"","thumb":"http:\/\/openwebvancouver.ca\/sites\/default\/files\/imagecache\/mobile_thumb\/rickard_falkvinge_0.jpg","site":"http:\/\/rickfalkvinge.se\/english","bio":"Rickard \"Rick\" Falkvinge (IPA: \/'falk'viŋe\/), born Dick Augustsson on 21 January 1972 in Gothenburg, is a Swedish IT entrepreneur known as the leader and founder of the Swedish Pirate Party.\r\n\r\nFalkvinge graduated from Göteborgs Högre Samskola where he studied natural science in 1991. During his studies he was active in the Moderate Youth League (Swedish: Moderata Ungdomsförbundet), the youth wing of the Swedish Moderate Party.\r\n\r\nHe started his first company in 1988 at the age of 16.\r\n\r\nIn 1993 he began studies for a degree in Engineering Physics at the Chalmers University of Technology in Gothenburg. He dropped out 1995 to work as an entrepreneur.\r\n\r\nFalkvinge has previously worked as a project leader at Microsoft. He was manager of development at a smaller software company but resigned to work with the Pirate Party on a full time basis. The Danish documentary Good Copy Bad Copy includes segments of an interview with Falkvinge explaining the emergence of the Pirate Party in response to the May 2006 police raid on The Pirate Bay.\r\n\r\nHe currently resides in Sollentuna north of Stockholm."},"title":"KEYNOTE - Topic: Piratpartiet\/ Sweden's Pirate Party","description":"The Pirate Party (Swedish: Piratpartiet) is a political party in Sweden as well as the fourth largest party counted in registered members[1] in Sweden which has given rise to parties with the same name and similar goals in Europe and worldwide. The Party strives to reform laws regarding copyright and patents. The agenda also includes support for a strengthening of the right to privacy, both on the Internet and in everyday life, and the transparency of state administration. \r\n\r\n- http:\/\/en.wikipedia.org\/wiki\/Pirate_Party","track":"A","room":"201"},{"datetime":"2009-06-11 10:30","speaker":{"name":"Amy Walker and Wendell Challenger","twitter":"","thumb":"http:\/\/openwebvancouver.ca\/sites\/default\/files\/imagecache\/mobile_thumb\/amy_walker_0.jpg","site":"http:\/\/www.momentumplanet.com","bio":"Amy Walker is the publisher of MOMENTUM. She likes riding her bike better than sitting at the computer."},"title":"Topic: Momentum Magazine and the Open Web","description":"How Momentum Magazine uses Open Source to publish online version of magazine and promote cycling culture.","track":"A","room":"201"},{"datetime":"2009-06-11 10:30","speaker":{"name":"Tum Tum, the Friendly Salmon","twitter":"http:\/\/twitter.com","thumb":"http:\/\/openwebvancouver.ca\/sites\/default\/files\/imagecache\/mobile_thumb\/tum_tum_salmon.jpg","site":"http:\/\/media.wildernesscommittee.org\/news\/2009\/03\/12575.php","bio":"Tum Tum means \"Brave\" in Chinook. Tum Tum was born on a fish farm in the Gulf Islands but escaped through perseverance, intelligence and the help of his fellow fish captives. \r\n\r\nHe hit the Open Web in search of tools that would give him what he needed to take on the powerful trimumverate of government, industry and media.  He reports from the field, telling us how the fight is going, how many of his compadres he has sprung, and their next steps in organizing and freeing the Salmon Nation."},"title":"Tum Tum: Glorious Explorations of Open Web Technologies, for Make Benefit Freedom of Salmon Fish Nation","description":"Tum Tum will talk about the online components of his campaign to stop fish farming: what has worked, what would work better and his wishlist for Open Source tools.","track":"A","room":"201"},{"datetime":"2009-06-11 10:30","speaker":{"name":"Ben Galbraith and Dion Almaer","twitter":"dalmaer","thumb":"http:\/\/openwebvancouver.ca\/sites\/default\/files\/imagecache\/mobile_thumb\/ben_galbraith-_dion_almaer_0.jpg","site":"http:\/\/ajaxian.com","bio":"Dion Almaer is the co-founder of Ajaxian.com, the leading source of the Ajax community. For his day job, Dion co-leads a new group at Mozilla focusing on developer tools for the Web, which is something he has been passionate about doing for years, and is excited for the opportunity! Dion has been writing rich web applications from the beginning, and has been a columnist on various topics at ONJava, TheServerSide.com, openxource.com and of course his blog at almaer.com\/blog. \r\n\r\nBen Galbraith is a frequent technical speaker, occasional consultant, and author of several Java-related books. He is a co-founder of Ajaxian.com, an experienced Chief Technical Officer and Enterprise Java Architect, and is presently co-leading a new group at Mozilla focusing on developer tools for the Web. Ben wrote his first computer program when he was six years old, started his first business at ten, and entered the IT workforce just after turning twelve. For the past few years, he’s been professionally coding in Java. In 2005, Ben delivered over a hundred technical presentations at venues including JavaOne, JavaPolis, and the No Fluff Just Stuff Java Symposiums."},"title":"Topic: The Future of Web Applications and\/or Bespin","description":"- The Future of Web Applications, discussing how canvas, fast javascript, web workers, and native integration are enabling new classes of web applications. Could discuss Thunderhead in here as well, as well as the Open Web Platform \/ Open Web Developer's Center project we're working on.\r\n\r\n- Bespin, discussing the web-based code editor\r\n\r\n- Creating Compelling User Experiences, a talk devoted to how you can create software users love","track":"A","room":"201"}]}